In [1]:
# pandas--->pandas is an open-source library that is used for handel data manipulations.

In [2]:
# data structure of pandas--->
# (1). series ---> 1-dimansional array and it contain only value.
# (2).dataframe-->multi-dimansional array contain values with colums name.

In [6]:
import pandas as pd

In [7]:
# series-->
a=pd.Series([1,10,20,34])
a

0     1
1    10
2    20
3    34
dtype: int64

In [8]:
# data framne --->
a={
    "Emp_ID":[1,2,3,4,5],
    "Emp_Name":['anil','amit','dinesh','naman','atul'],
    "Domain":['IT','Sales','IT','IT','Sales'],
    "Working_hour":[8,9,8,9,8],
    "Salary":[20000,30000,40000,50000,50000]
}
df=pd.DataFrame(a)
df

   Emp_ID Emp_Name Domain  Working_hour  Salary
0       1     anil     IT             8   20000
1       2     amit  Sales             9   30000
2       3   dinesh     IT             8   40000
3       4    naman     IT             9   50000
4       5     atul  Sales             8   50000

In [11]:
df.to_csv("C:\\Users\\anilj\\OneDrive\\Desktop\\Emp_data\\Emp_data.csv")

In [13]:
df.to_csv("C:\\Users\\anilj\\OneDrive\\Desktop\\Emp_data\\Emp_data.csv",index=False)

In [16]:
# Import data-->
df=pd.read_csv("C:\\Users\\anilj\\OneDrive\\Desktop\\Emp_data\\Emp_data.csv")

In [17]:
df

   Emp_ID Emp_Name Domain  Working_hour  Salary
0       1     anil     IT             8   20000
1       2     amit  Sales             9   30000
2       3   dinesh     IT             8   40000
3       4    naman     IT             9   50000
4       5     atul  Sales             8   50000